Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཟབ་མོ་བརྟན་པ་འཐོབ་པ་ལ་འཇུག་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called aspects of bringing about the attainment of the stable, profound gnosis of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྲིན་ཆེན་པོའི་སྙིང་པོའི་ཆར་གྱི་རྒྱུན་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called storehouse of inconceivable merit of the flowing rainof the great cloud essence of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྲིན་ཆེན་པོའི་ཆར་གྱི་རྒྱུན་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་ཀྱི་རྣམ་པའི་ལམ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called path of the aspect of the inconceivable merit of the flowing rain of the great cloud of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྲིན་ཆེན་པོའི་ཚོགས་ནམ་མཁའ་ལས་འབྱུང་ཞིང་འདུ་བའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called king of the magical manifestation of the mass of great clouds of the tathāgatas and bodhisattvas that arises and gathers in space.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྲིན་ཆེན་པོའི་གློག་གི་འོད་སྣང་བའི་སྒོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called gateways to the brilliant lightning of the great cloud of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྲིན་ཆེན་པོའི་གློག་འགྱུ་བ་དང་ལྡན་པ་ལ་འཇུག་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called aspects of entering the great cloud of the tathāgatas and bodhisattvas, which flashes with lightning.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྲིན་ཆེན་པོའི་གློག་གི་སྒྱུ་འཕྲུལ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called illusory emanation of the lightning of the great cloud of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོ་འཕྲུལ་ཆེན་པོའི་སྒྲོན་མ་སྟོན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called display of the great miraculous lamp of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་ཐོག་ཏོག་གི་འབེལ་བའི་གཏམ་ལ་འཇུག་པའི་རྣམ་པར་འཕྲུལ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called king of the magical manifestation of entry into the elaborate exposition of the hail of Dharma of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་རྡོ་རྗེའི་རྣམ་པ་ལ་འཇུག་པའི་མཛོད་སྲུང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called guarding the storehouse of entry into the vajra gnosis of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལོངས་སྤྱོད་མི་ཟད་པའི་རྣམ་པ་ལ་འཇུག་པ་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called king of the magical manifestation of entry into the inexhaustible enjoymentsof the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡང་དག་པའི་ལམ་གྱི་རྣམ་པ་མངོན་པར་མཚོན་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called entry into the direct demonstration of the correct path of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྲ་ཞིང་ཟབ་པའི་གླེང་གཞིའི་རྣམ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called entry into the subtle and profound topics of discourse of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེང་གེའི་རྣམ་པར་རྩེ་བ་ལ་དམིགས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called observation of the lion’s play of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མཚམས་སྦྱོར་བ་ཚོགས་པའི་རྣམ་པ་འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་བྱ་བ་ལ་འཇུག་པའི་མདོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called discourse on engaging in activities in harmony with the world that accumulate the tathāgatas’ and bodhisattvas’ connections for rebirth.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་རྩེ་བའི་རིན་པོ་ཆེའི་མཛོད་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called entering into the precious storehouse of the play of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནམ་མཁའ་ལྡིང་གི་རྩལ་ཆེན་པོའི་སྟོབས་ལ་མངོན་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called engaging in the garuḍa’s great potent strength of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲ་ཆེན་པོའི་དུས་རྣམ་པར་བསྒྲགས་པ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called king of the manifestation of the proclamation of the time of the great roar of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་འཇིགས་པ་ཆེན་པོའི་སྟོབས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called engaging in the magical manifestation of the strength of the great fearlessness of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གནས་ཀྱི་རྣམ་པ་དང་བཅས་པ་ཡངས་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called vastness having aspects of the abode of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལྷག་པའི་བསམ་པའི་ཆོ་ག་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called engaging in the procedures of the superior intention of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམག་ཆེན་པོ་དཔའ་བའི་རྒྱལ་པོའི་སྟོབས་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called manifestation of the strength of the heroic king of the great army of tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བཟང་པོ་རྣམ་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called becoming the king of the magical manifestation of the aspects of the excellence of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྩེ་བ་དང་བཅས་པ་ཡང་དག་པར་སྦས་པ་སྟོན་པའི་དཔུང་ཆེ་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called engaging in marshalling the force that reveals the correct concealment associated with the play of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་རྩོམ་པའི་ཆོ་ག་ལ་ཞུགས་པའི་རྣམ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called aspects of engaging in procedures for engendering the gnosis of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་ནོར་བསྒྲིམས་ཏེ་བསྒྲུབས་པའི་མཛོད་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called storehouse of the riches of the tathāgatas’ and bodhisattvas’ gnosis that is attained through concentration.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡང་དག་པའི་མཆོད་སྦྱིན་ལ་ཕན་པའི་ཆོ་ག་བཀོད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called the array of procedures conducive to correctly offering and giving to tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡང་དག་པའི་ས་བོན་རབ་ཏུ་སྐྱེད་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called the full production of the correct seed of the buddhafield of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དེ་ཁོ་ནའི་སྙིང་པོའི་ཚུལ་གྱིས་མངོན་པར་རྩེ་བ་ལ་དགའ་བའི་རྒྱལ་པོའི་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called engaging in the magical manifestation of the king of delighting in the play of the state of the essence of reality of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པའི་ཡོན་ཏན་གྱིས་ཡོངས་སུ་བརྒྱན་པ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རིན་པོ་ཆེའི་མཛོད་ཀྱི་གཏེར་ཆེན་པོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དམ་པའི་ཆོས་བརྟན་ཞིང་མི་ཟད་པའི་གཏེར་ལ་ལྟོས།
en: “Great Cloud Essence, you should view this Great Cloud discourse, which is completely adorned with the various qualities of its inconceivable domain, as the inconceivable great precious treasury of the tathāgatas and bodhisattvas and the inexhaustible, steadfast treasury of the sacred Dharma of all sentient beings.

source: སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡང་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ལྟོས།
en: Great Cloud Essence, moreover, you should view the domain of this Great Cloud discourse as inconceivable.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཞེས་བྱ་བའི་གསང་བའི་ཆོས་ཀྱི་སྒོ་དག་ཡོད་དོ། །
en: “Great Cloud Essence, within the inconceivable domain of this Great Cloud discourse there is the secret Dharma gateway called the tathāgata way of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཟབ་མོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata profundity of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྒྱ་མཚོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata ocean of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་གཞུང་ལུགས་གསང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the secret tathāgata discourse tradition of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་བསྲུང་བ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called entry into the tathāgata protection of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་བརྗོད་པ་གསང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the correctly proclaimed tathāgata secret of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་དམིགས་པ་གསང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the secret tathāgata perception of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཉི་མ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata sun of thetathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཟླ་བའི་དཀྱིལ་འཁོར་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata moon of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཏོག་ཅེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata emblem of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་མཚམས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata limit of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་གནོན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata subjugation of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ངེས་པའི་མུ་སྟེགས་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata certainty for non-Buddhists of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་དགྱེས་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called endowed with the tathāgata delight of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་མཛོད་ཅེས་བྱ་བའི་གསང་བའི་ཆོས་ཀྱི་སྒོ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there is the Dharma gateway called the tathāgata storehouse of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་ཀྱི་ཚུལ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལོངས་སྤྱོད་མི་ཟད་པའི་གཏེར་ལ་ལྟོས།
en: “Great Cloud Essence, you should view the domain of this Great Cloud discourse as the way of the sacred Dharma of the Tathāgata and an inexhaustible treasury of enjoyments for all sentient beings.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ལྟོས།
en: Great Cloud Essence, you should view the domain of this Great Cloud discourse as inconceivable.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡང་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་ཐར་པའི་རྣམ་པ་དང་།
en: Great Cloud Essence, within this Great Cloud discourse there are the aspects of the inconceivably inconceivable complete liberation of the tathāgatas and bodhisattvas.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་འཐོབ་པ་བརྒྱ་སྟོང་དུ་མ་དང་།
en: There is the attainment of hundreds of thousands of samādhis and dhāraṇīs.

source: གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་འཇིག་རྟེན་གྱི་རྗེས་སུ་འཇུག་པའི་མཛད་པ་དུ་མ་དང་།
en: Again, there are a myriad of activities performed by tathāgata, foe-destroyer, complete and perfect buddhas to enter into the world.

source: དེ་བཞིན་གཤེགས་པའི་གསང་བ་བྱེ་བ་བརྒྱ་སྟོང་ཁྱོད་དང་འདྲ་བ་དག་གིས་ཀྱང་རྟོགས་པར་དཀའ་ཞིང་ཟབ་ལ་ཕྲ་སྟེ་བརྡ་ཕྲད་པར་དཀའ་བའི་ཚིག་གི་དོན་ཤིན་ཏུ་སྦས་པ་དང་།
en: There are hundreds of thousands of millions of tathāgata secrets, which even you and those like you would find difficult to understand, whose profundity is subtle and hard to realize and whose literal meaning is extremely well concealed.

source: དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཤིན་ཏུ་ཕྲ་ཞིང་ཤིན་ཏུ་བྱང་ལ་ཟབ་པའི་ཚིག་དང་། དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་གི་ཚིག་ཁྱོད་ཀྱིས་ཀྱང་སྔོན་ཚིག་དང་ཡི་གེ་གཅིག་ཀྱང་མ་ཐོས་པའི་ཚིག་ཡོད་དེ་རིམ་བཞིན་དུ་ཕྱིས་བཤད་པར་བྱའོ། །
en: There are the profound statements about the domain of the Tathāgata, which are extremely fine and extremely skilled, and there are statements about the concealed intent of the Tathāgata. There are words and syllables that you have never heard before—not even once. Presently, I will explain each of these.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་མིག་མཆི་མས་གང་བཞིན་དུ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the bodhisattva mahāsattva Great Cloud Essence rose from his seat, draped his robe over one shoulder, touched his right knee to the ground, and prostrated, touching his head to the Bhagavān’s feet. With tears filling his eyes, he addressed the Bhagavān, saying,

source: ཀྱེ་མ་བཅོམ་ལྡན་འདས་བདག་ཅག་ལ་སོགས་པ་རྣམས་དང་། སྦྲང་བུ་དང་། སྡིག་སྦྲུལ་དང་། བྱི་བ་དང་། ལྐུགས་པ་དང་། ལོང་བ་དང་། འོན་པ་ལྟ་བུའི་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་སྤྲིན་ཆེན་པོའི་མདོའི་ཚིག་སྨོས་ཏེ་
en: “O Bhagavān! Out of pity for us sentient beings who are like flies, scorpions, and mice and like those who are mute, blind, and deaf, you have given this reply and described the words of this Great Cloud discourse.

source: བཀའ་སྩལ་པ་ནི་ཀྱེ་མ་བཅོམ་ལྡན་འདས་ངོ་མཚར་རྨད་དུ་བྱུང་བ་ལགས་སོ། །
en: O Bhagavān, this is truly a wondrous marvel!

source: དེ་བཞིན་གཤེགས་པས་སྤྲིན་ཆེན་པོའི་མདོའི་ཚིག་སྨོས་ཤིང་གསུངས་ཏེབདག་ཅག་ལ་སོགས་པ་སེམས་ཅན་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྟག་པའི་གྲོང་ཁྱེར་གྱི་སྐས་ལ་འཛེག་པར་བགྱི་བའི་སླད་དུ་དེ་བཞིན་གཤེགས་པས་ཤིན་ཏུ་ལེགས་པར་བཀའ་སྩལ་པ་ལགས་ན།
en: If the Tathāgata would describe and expound the words of this Great Cloud discourse so that I and all sentient beings could ascend the stairway to the citadel of the permanent greatness of the Tathāgata’s qualities, this would truly be a most excellent reply.

source: ད་ཡང་བདག་ཅག་ལ་སོགས་པ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། གྲུམ་པོ་དང་། ལག་རྡུམ་དང་། དམུས་ལོང་དང་། ལྐུགས་པ་དང་། འོན་པ་དང་། ཡན་ལག་ཐམས་ཅད་ཉམས་པར་གྱུར་པའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པས་བཟོད་པ་དང་། བྱམས་པར་དགོངས་པ་དང་། ཐུགས་རྗེ་ཞིང་ཐུགས་བརྩེ་བའི་སླད་དུ་བདག་ཅག་གིས་ཚིག་དང་ཡི་གེ་གཅིག་གི་ཐིག་ལེ་ཙམ་ཡང་སྔོན་ཆད་མ་ཐོས་པ། དེ་བཞིན་གཤེགས་པའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པའི་མདོ། དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་གྲོང་ཁྱེར་གྱི་སྐས་དང་ཐེམ་སྐས་ཡོན་ཏན་གྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བརྒྱན་པ་བཤད་དུ་གསོལ།
en: With patience, loving-kindness, compassion, and pity toward all of us sentient beings and the śrāvakas and pratyekabuddhas—who are like cripples, like those with no arms, like those who are blind, mute, and deaf, and like those whose limbs are all impaired—please explain to us the discourse on the inconceivable domain of the Tathāgata of which we have not formerly heard even a single word or syllable, which is fully adorned with the collection of qualities that are the stairway to the citadel of the permanence, eternality, constancy, and tranquility of the Tathāgata.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Then, the Bhagavān replied to the bodhisattva mahāsattva Great Cloud Essence, saying,

source: སྤྲིན་ཆེན་སྙིང་པོ་དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་སྨོས་པ་ཁྱོད་ཀྱིས་ཁོང་དུ་ཆུད་དེ་ཤིན་ཏུ་ལེགས་པར་རྟོགས་པ་ལེགས་སོ། །ལེགས་སོ། །
en: “Excellent, Great Cloud Essence! It is extremely excellent that you have realized and comprehended so well the concealed intent of the Tathāgata’s speech.

source: སྤྲིན་ཆེན་སྙིང་པོ་དེ་ལྟར་ན་སྤྲིན་ཆེན་པོའི་མདོ་དེ་བཞིན་གཤེགས་པའི་ཡུལ་ནི་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: Great Cloud Essence, in this fashion, the domain of this Great Cloud discourse is inconceivable.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་རྗེས་སུ་ཡི་རང་བར་གྱིས་ཤིག །
en: Great Cloud Essence, you should rejoice in the inconceivable domain of The Great Cloud discourse.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཁྱོད་ཀྱིས་སྤྲིན་ཆེན་པོའི་མདོ་དང་འཐུན་པར་དམ་བཅས་ཤིང་སྨོན་ལམ་བཏབ་པ་ནི་ཁྱོད་ཡེ་ཤེས་ཟབ་མོ་དང་ལྡན་པ་ཡིན་གྱིས་
en: Great Cloud Essence, by making vows and aspirations in accordance with this Great Cloud discourse, you will gain possession of profound gnosis.

source: སྤྲིན་ཆེན་སྙིང་པོ་མ་སྐྲག་ཅིག །
en: Great Cloud Essence, you should not be scared.

source: སྤྲིན་ཆེན་སྙིང་པོ་མ་འཇིགས་ཤིག །
en: Great Cloud Essence, you should not be fearful.
